---
kind: type
id: T:Autodesk.Revit.UI.RibbonButton
source: html/0f523e1e-6949-451f-97fc-48c3cd9d7c82.htm
---
# Autodesk.Revit.UI.RibbonButton

This class is the base class of PushButton and PulldownButton.

## Syntax (C#)
```csharp
public class RibbonButton : RibbonItem
```